Repository: amal-davis/pcdot-computers
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: About Us
ar: معلومات عنا

source: Search your product
ar: ابحث عن منتجك

source: Cart
ar: عربة التسوق

source: Wishlist
ar: قائمة الرغبات

source: My Orders
ar: طلباتي

source: My Wishlist
ar: قائمة رغباتي

source: My Cart
ar: عربتي

source: Logout
ar: تسجيل الخروج

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Home
ar: الرئيسية

source: Products
ar: المنتجات

source: Installment
ar: التقسيط

source: We believe that customer satisfaction is our first requirement and can only come through:
ar: نعتقد أن رضا العملاء هو أول متطلباتنا ولا يمكن تحقيقه إلا من خلال:

source: Good treatment
ar: معاملة جيدة

source: Best price
ar: أفضل سعر

source: Technical support
ar: الدعم الفني

source: Customer confidence
ar: ثقة العملاء

source: We are fully committed to all that. We strive to win your satisfaction.
ar: نحن ملتزمون تمامًا بكل ذلك. نحن نسعى جاهدين لكسب رضاكم.

source: We always hear from you. Please feel free to send us your comments and suggestions.
ar: نحن دائمًا نستمع إليك. لا تتردد في إرسال تعليقاتك واقتراحاتك.

source: Official Logo
ar: الشعار الرسمي

source: Our top priority is ensuring customer satisfaction, which we achieve through excellent service, competitive pricing, reliable technical support, and earning your trust. We are dedicated to maintaining these standards and continually seek to improve. Your feedback is invaluable to us, and we encourage you to share your thoughts and suggestions with us.
ar: أولويتنا القصوى هي ضمان رضا العملاء، وهو ما نحققه من خلال الخدمة الممتازة، الأسعار التنافسية، الدعم الفني الموثوق، وكسب ثقتكم. نحن ملتزمون بالحفاظ على هذه المعايير ونسعى باستمرار للتحسين. تعليقاتكم ذات قيمة كبيرة بالنسبة لنا، ونشجعكم على مشاركة آرائكم واقتراحاتكم معنا.

source: Our Shop
ar: متجرنا

source: Customer satisfaction is our priority, achieved through excellent service, fair pricing, and reliable support.
ar: رضا العملاء هو أولويتنا، ويتم تحقيقه من خلال خدمة ممتازة، وتسعير عادل، ودعم موثوق.

source: PCDOT computer, Khamis Mushait, Hossam Alkhalij Street.
ar: بي سي دوت كمبيوتر - خميس مشيط - حي الربيع - شارع الخليج

source: Username
ar: اسم المستخدم

source: GO
ar: اذهب

source: Add Video Reels
ar: إضافة مقاطع فيديو

source: Add Brand Logos
ar: إضافة شعارات العلامة التجارية

source: Add Desktop Carousel Images
ar: ضافة صور عرض شرائح سطح المكتب

source: Add Mobile Carousel Images
ar: إضافة صور عرض شرائح الهاتف المحمول

source: Price
ar: السعر

source: Quantity
ar: الكمية

source: Subtotal
ar: الإجمالي الفرعي

source: Shiping Charge
ar: تكلفة الشحن

source: Total
ar: الإجمالي

source: Proceed to Checkout
ar: التوجه إلى الدفع

source: Filter By
ar: التصفية حسب

source: Low to High
ar: من الأقل إلى الأعلى

source: High to Low
ar: من الأعلى إلى الأقل

source: Alphabetical Order
ar: ترتيب أبجدي

source: A to Z
ar: أ إلى ي

source: Z to A
ar: ي إلى أ

source: Add To Cart
ar: أضف إلى السلة

source: Pcdot Commercial Registry No:5864525743
ar: مؤسسة أحمد القرني للحاسب الالي: 5864525743

source: Warranty Policies
ar: سياسات الضمان

source: Checkout Page
ar: صفحة الدفع

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Country
ar: البلد

source: Address
ar: العنوان

source: City
ar: المدينة

source: Phone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

source: Proceed to Payment
ar: التوجه إلى الدفع

source: PCDOT Computer
ar: بي سي دوت كمبيوتر

source: Latest Products
ar: أحدث المنتجات

source: Password
ar: كلمة المرور

source: Not have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Add to Cart
ar: أضف إلى السلة

source: Buy Now
ar: اشتر الآن

source: Recommended Products
ar: المنتجات الموصى بها

source: Our Products
ar: المنتجات

source: Create Account
ar: إنشاء حساب

source: The computer cannot be returned for any reason, and faulty parts will be replaced by the agent.
ar: يمنع إرجاع الكمبيوتر لأي سبب من الأسباب ويتم استبدال القطع المتعطلة من قبل الوكيل.

source: Based on the instructions of the Ministry of Commerce, all parts under warranty are subject to the 'consumable value' policy.
ar: بناءً على تعليمات وزارة التجارة، تخضع جميع القطع في الضمان لسياسة 'القيمة الاستهلاكية'.

source: The guarantor is the agent.
ar: الضامن هو الوكيل.

source: Shipping to the agent inside or outside Saudi Arabia is at the customer's expense.
ar: الشحن إلى الوكيل داخل أو خارج السعودية على حساب العميل.

source: The warranty period for most parts is two years for hardware manufacturing defects.
ar: مدة الضمان على أكثر القطع سنتين على العيوب المصنعية للهاردوير.

source: If the serial number on the item’s packaging or the warranty sticker is removed, we will not be able to cover the repair costs. Please ensure that the serial number is not tampered with or removed. In such cases, we will not be able to serve you.
ar: إذا تمت إزالة الرقم التسلسلي عن غلاف السلعة والستيكر الخاص بالضمان، لن نستطيع تغطية تكاليف الإصلاح. يرجى التأكد من عدم العبث بالرقم التسلسلي أو إزالته. في حالة حدوث ذلك، لن نستطيع خدمتك.

source: We cannot serve you if the original product packaging, especially the monitor box, is not available.
ar: لا يمكننا خدمتك في حال عدم توفر الكراتين الأصلية للمنتج وخصوصاً كرتون الشاشة.

source: The warranty is for manufacturing defects only and does not cover other malfunctions such as breakages or damages resulting from misuse.
ar: الضمان هو للعيوب المصنعية فقط ولا يشمل الأعطال الأخرى مثل الكسور أو الأضرار الناتجة عن سوء الاستخدام.

source: The warranty does not apply to any damages resulting from (using incompatible accessories with the item – not following the manufacturer’s instructions).
ar: لن ينطبق الضمان لأية أضرار ناجمة عن (استخدام اكسسوارات غير متوافقة مع السلعة – عدم اتباع تعليمات الجهة المصنعة).

source: The warranty is void if the device’s box is opened without the approval of technical support.
ar: يعتبر الضمان لاغياً في حال فتح صندوق الجهاز دون موافقة الدعم الفني.

source: The warranty is void if the product is used improperly, such as overclocking the processor or graphics card, overheating, or installing dangerous software.
ar: يعتبر الضمان لاغياً في حال استخدام المنتج بطريقة غير صحيحة مثل كسر سرعة المعالج أو كرت الشاشة أو رفع الحرارة أو تحميل برامج خطرة.

source: We will inspect any part before sending it to the agent to ensure the problem is due to a manufacturing defect.
ar: سنقوم بفحص أي قطعة قبل إرسالها للوكيل للتأكد أن المشكلة ناتجة عن خطأ في التصنيع.

source: Attempting to repair the product at any non-authorized service center by the agent will void the warranty.
ar: محاولة صيانة المنتج عند أي مركز صيانة غير معتمد لدى الوكيل تلغي الضمان عن المنتج.

source: During the warranty period, you can repair the item each time it needs service.
ar: خلال فترة الضمان، يمكنك صيانة السلعة في كل مرة تحتاج فيها سلعتك للصيانة.

source: No external warranty extension options are available.
ar: لا يتوفر خيار تمديد ضمان من أي جهة خارجية.

source: The customer will pay all shipping costs in case of warranty.
ar: العميل سوف يدفع كامل مصاريف الشحن في حالة الضمان.

source: If a problem appears in the device within 72 hours of receiving it, the store will bear the shipping costs to and from the customer.
ar: إذا ظهرت مشكلة في الجهاز خلال 72 ساعة من استلامه، فإن المتجر يتحمل مصاريف الشحن من وإلى العميل.

source: The maximum maintenance period is 14 days from the date the agent receives the item, not from the date the store receives it.
ar: أقصى مدة للصيانة هي 14 يومًا من تاريخ استلام الوكيل للسلعة وليس من تاريخ استلام المتجر لها.

source: The warranty does not cover data; the warranty only covers hardware.
ar: لا يشمل الضمان البيانات؛ الضمان فقط يشمل الهاردوير.

source: Free gifts (such as accessories) have an operational warranty only.
ar: ضمان الهدايا المجانية (مثل الإكسسوارات) ضمان تشغيلي فقط.

source: Products without an agent in Saudi Arabia require 40 to 60 days for maintenance and warranty.
ar: المنتجات التي لا يوجد لها وكيل في السعودية تحتاج 40 إلى 60 يومًا للصيانة والضمان.

source: The customer bears the shipping costs for maintenance of products that do not have an agent in Saudi Arabia.
ar: يتحمل العميل قيمة تكاليف الشحن في حال الصيانة للمنتجات التي لا يوجد لها وكيل بالسعودية.

source: Any product purchased from the store is non-returnable except in case of:
ar: أي منتج يتم شراؤه من المتجر غير قابل للإرجاع إلا في حال:

source: A technical or manufacturing defect in the part, in which case it is referred to the warranty department for replacement or return after confirming the defect under the product warranty terms.
ar: أن يكون هناك عطل فني أو مصنعي في القطعة، وفي هذه الحالة يتم تحويلها إلى قسم الضمان للاستبدال أو الإرجاع بعد تأكيد وجود الخلل ضمن شروط ضمان المنتج.

source: The use of cards in mining is considered illegal, and the card malfunction is classified as misuse.
ar: يعتبر استخدام الكروت في التعدين غير مشروع ويصنف عطل الكرت كسوء استخدام.

source: Cancellation and return of the monitor order are prohibited if it has been shipped.
ar: يمنع إلغاء الطلب وإرجاع الشاشة في حال تم شحنها.

source: Warranty for chairs and tables: These products are considered consumables, so the operational warranty is comprehensive during the first 72 hours (the customer inspects the item for any shortage or problem in the operation of the chair and has the right to replace the product immediately).
ar: ضمان الكراسي والطاولات: تعتبر هذه المنتجات استهلاكية، لذلك فإن ضمان التشغيل يكون ضمان شامل خلال أول 72 ساعة (يقوم العميل بتفقد القطعة إن كان فيها أي نقص أو مشكلة في عمل الكرسي ويحق له استبدال المنتج مباشرة).

source: Remove
ar: إزالة
